app/controllers/comments_controller.rb

INSERT INTO `comments` (`updated_at`, `conteudo`, `comentavel_type`, `comentavel_id`, `created_at`) VALUES('2010-05-12 23:12:37', 'Prato sujo', 'Restaurante', 1, '2010-05-12 23:12:37')
---
  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save

SELECT * FROM `comments` WHERE (`comments`.`id` = 4)
UPDATE `comments` SET `comentavel_type` = 'Restaurante', `updated_at` = '2010-05-13 00:58:57' WHERE `id` = 4
---
  def update
    @comment = Comment.find(params[:id])

    respond_to do |format|
      if @comment.update_attributes(params[:comment])