app/controllers/restaurantes_controller.rb

  def create
    @restaurante = Restaurante.new(params[:restaurante])
    if @restaurante.save
---
INSERT INTO `restaurantes` (`updated_at`, `especialidade`, `endereco`, `nome`, `created_at`) VALUES('2010-05-11 01:16:23', 'Italiana', 'R dos Restaurantes, 126', 'Fasano', '2010-05-11 01:16:23')

  def show
    @restaurante = Restaurante.find(params[:id])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 4)

  def edit
    @restaurante=Restaurante.find(params[:id])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 4)

  def list #muita gente acaba não criando esse método porque muitos usam esse método na página index
    #@restaurantes = Restaurante.find (:all, :order => "nome")
    @restaurantes = Restaurante.paginate :page=>params['page'], :per_page=>3, :order=>"nome"
---
SELECT * FROM `restaurantes` ORDER BY nome LIMIT 0, 3
SELECT count(*) AS count_all FROM `restaurantes`

  def update
    @restaurante = Restaurante.find(params[:id])
    if @restaurante.update_attributes(params[:restaurante])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 6)
UPDATE `restaurantes` SET `nome` = 'Spoleto', `updated_at` = '2010-05-11 01:05:43' WHERE `id` = 6

  def destroy
    restaurante = Restaurante.find(params[:id])
    restaurante.destroy
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 4)
DELETE FROM `restaurantes` WHERE `id` = 4

  def search
    @restaurantes = Restaurante.find(:all,:conditions=>"especialidade='#{params[:especialidade]}'")
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`especialidade` = 'Italiana') LIMIT 1